#language: ru
Функционал: Яндекс Маркет

  Сценарий: Поиск телевизоров

    Когда выбран базовый урл Яндекса"https://yandex.ru/"
    Когда нажатие на – Маркет
    Когда переключиться на вкладку - Маркет
    Когда выбрать – Электроника
    Когда выбрать – Телевизоры
    Когда нажать кнопку Все фильтры
    Когда заполнен фильтр Минимальная цена значением "20000"
    Когда выбор производителей телевизоров
    Когда нажатие кнопки Применить и ожидание загрузки страницы "Телевизоры"
    Когда заполнение Поиска телевизоров значением и поиск
    Тогда закрытие вкладки Маркет

  Сценарий: Поиск наушников

    Когда выбран базовый урл Яндекса"https://yandex.ru/"
    Когда нажатие на – Маркет
    Когда переключиться на вкладку - Маркет
    Когда выбрать – Электроника
    Когда выбрать – Наушники
    Когда нажать кнопку Все фильтры
    Когда заполнен фильтр Минимальная цена значением "5000"
    Когда выбор производителей наушников
    Когда нажатие кнопки Применить и ожидание загрузки страницы "Наушники и Bluetooth-гарнитуры"
    Когда заполнение Поиска наушников значением и поиск
    Тогда закрытие вкладки Маркет